tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'

tap 'drone/drone'
tap 'heroku/brew'
tap 'nodenv/nodenv'
tap 'thoughtbot/formulae'

# Build tools and libs
brew 'coreutils'
brew 'gmp'
brew 'libyaml'
brew 'makedepend'
brew 'pkg-config'
brew 'readline'

brew 'antigen'
brew 'awscli'
brew 'bat'
brew 'chromedriver'
brew 'diff-so-fancy'
brew 'drone'
brew 'fasd'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'gnu-tar'
brew 'goenv'
brew 'heroku/brew/heroku'
brew 'hub'
brew 'imagemagick'
brew 'jq'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'kube-ps1'
brew 'mas'
brew 'node-build'
brew 'nodenv-aliases'
brew 'nodenv-vars'
brew 'nodenv'
brew 'openssl'
brew 'pyenv'
brew 'python-build'
brew 'thoughtbot/formulae/parity'
brew 'rbenv-aliases'
brew 'rbenv-default-gems'
brew 'rbenv-vars'
brew 'rbenv'
brew 'rcm'
brew 'ruby-build'
brew 'sshfs'
brew 'terraform'
brew 'thefuck'
brew 'tldr'
brew 'wifi-password'
brew 'yarn'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
brew 'zsh'

brew 'ack'
brew 'nmap'
brew 'tree'
brew 'watch'
brew 'wget'

brew 'postgresql', start_service: false
brew 'mysql', start_service: false
brew 'redis', start_service: false

cask '1password-cli'
cask 'alfred'
cask 'bitbar'
cask 'captain'
cask 'daisydisk'
cask 'dash'
cask 'discord'
cask 'homebrew/cask-versions/docker-edge'
cask 'etcher'
cask 'homebrew/cask-drivers/focusrite-control'
cask 'google-chrome'
cask 'google-photos-backup-and-sync'
cask 'harvest'
cask 'hyper'
cask 'iterm2'
cask 'kap'
cask 'karabiner-elements'
cask 'keepingyouawake'
cask 'mark-text'
cask 'numi'
cask 'osxfuse'
cask 'sequel-pro'
cask 'sketch'
cask 'skype'
cask 'spectacle'
cask 'spotify'
cask 'telegram'
cask 'trezor-bridge'
cask 'tunnelblick'
cask 'visual-studio-code'

# Quicklook plugins
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicklookapk'

mas "com.agilebits.onepassword7", id: 1333542190
mas "Annotate", id: 918207447
mas "Noizio", id: 928871589
mas "Simplenote", id: 692867256
mas "Slack", id: 803453959"
mas "Textual", id: 896450579
mas "Todoist", id: 585829637
mas "ToothFairy", id: 1191449274
